# LSE Course 2 Week 3: Convener tutorial videos

## Concat multiple DataFrames with Pandas

### Video brief:
Helping a professor in need with the concat() function: This tutorial is a response to a scenario presented on the page about a request from a professor for help to keep track of her students. The video comes after we've introduced the concat() function and takes the learners through four simple steps to help solve Prof Minnaar issue (which will be presented as an email in the video). Information about the merge() function comes after the video.

#

## Step 1: Import CSV files

In [1]:
# import libraries
import pandas as pd
import numpy as np

In [2]:
# read CSV files
classlist_a = pd.read_csv("classlist_a.csv")
classlist_b = pd.read_csv("classlist_b.csv")
classlist_c = pd.read_csv("classlist_c.csv")
classlist_d = pd.read_csv("classlist_d.csv")

#

## Step 2: Concat four files

In [3]:
# concat all four DataFrames
classlist_final = pd.concat([classlist_a, classlist_b, classlist_c, classlist_d])
classlist_final

,Student number,Surname,Initials,Final mark,Class
0,15476227,AFONSO,L,47.72,E
1,15311279,ALBERTYN,F J H,57.52,A
2,15637913,ALEXANDER,L,90.68,E
3,15124150,BAM,A J,56.43,E
4,15829626,BARROW,S B,79.64,E
...,...,...,...,...,...
214,16443144,WIJERS,MC,93.00,E
215,14955849,WIJNBERG,JM,47.00,E
216,17140293,WILLIAMS,CA,43.00,A
217,16771354,WOLHUTER,J,76.00,E
218,17094607,ZINN,A,74.00,E

In [4]:
# concat all four DataFrames
classlist_cd = pd.concat([classlist_c, classlist_d])
classlist_cd

,Student number,Surname,Initials,Final mark,Class
0,15849376,ADENDORFF,K,76.50,E
1,15805751,AUDITORE,L,64.25,E
2,16160045,BAARD,JC,51.25,E
3,16488547,BADENHORST,MJ,68.00,A
4,16586263,BASSON,J,57.75,A
...,...,...,...,...,...
214,16443144,WIJERS,MC,93.00,E
215,14955849,WIJNBERG,JM,47.00,E
216,17140293,WILLIAMS,CA,43.00,A
217,16771354,WOLHUTER,J,76.00,E
218,17094607,ZINN,A,74.00,E

In [5]:
# concat all four DataFrames
classlist_ab = pd.concat([classlist_a, classlist_b])
classlist_ab

     Student number    Surname Initials  Final mark Class
0          15476227     AFONSO        L       47.72     E
1          15311279   ALBERTYN    F J H       57.52     A
2          15637913  ALEXANDER        L       90.68     E
3          15124150        BAM      A J       56.43     E
4          15829626     BARROW      S B       79.64     E
..              ...        ...      ...         ...   ...
121        16037804    VIVIERS       SF       59.31     A
122        16239369    WATKINS       TL       76.71     A
123        16070356  WILKINSON       GN       62.04     E
124        16083814       WISE       EA       71.82     E
125        16324773      ZONDI       WP       74.46     A

[271 rows x 5 columns]

#

## Step 3: Sorting the table

In [6]:
# sort class list alphabetically and according to student number
classlist_final_sorted = sorted(classlist_final)
classlist_final_sorted

['Class', 'Final mark', 'Initials', 'Student number', 'Surname']

In [15]:
# sort class list alphabetically
classlist_final_sort = classlist_final.sort_values(by='Surname')
classlist_final_sort

,Student number,Surname,Initials,Final mark,Class
0,15793648,ABRAHAMS,B,48.00,E
1,17483638,ACKERMANN,E,45.00,E
0,15849376,ADENDORFF,K,76.50,E
0,15476227,AFONSO,L,47.72,E
2,16564499,ALBERTUS,S,57.00,E
...,...,...,...,...,...
143,15849390,YOUNG,V A,88.05,E
218,17094607,ZINN,A,74.00,E
144,15897184,ZONDAGH,L,59.10,E
125,16324773,ZONDI,WP,74.46,A
184,16782879,ZUMA,MC,64.50,A

In [16]:
# sort class list according to student number
classlist_final_sort = classlist_final.sort_values(by='Student number')
classlist_final_sort

,Student number,Surname,Initials,Final mark,Class
37,13418041,FOURIE,R B,62.58,E
45,14172682,HEUNIS,W,62.25,A
108,14438321,SCHAFFERS,I C,0.00,E
115,14558289,MILLER,N,92.00,E
91,14574462,LEYGONIE,IR,54.00,A
...,...,...,...,...,...
111,17465133,MBATHA,PC,25.00,A
1,17483638,ACKERMANN,E,45.00,E
178,17624258,STOFBERG,Z,42.00,E
173,17725070,STAMP,JR,86.00,E
128,18376673,NEWTON,KA,83.00,A